In [1]:
%load_ext sql

In [2]:
%sql postgresql://enterprisedb:123qwe123@localhost:5444/stocks

In [102]:
%sql select customerid, lastname, birthdate from customer fetch first 10 rows only

 * postgresql://enterprisedb:***@localhost:5444/stocks
10 rows affected.

[(100000, 'Brock', '1960-10-13'),
 (100001, 'Chandler', '1971-02-12'),
 (100002, 'Merrill', '1988-08-02'),
 (100003, 'Wells', '1959-03-11'),
 (100004, 'Lambert', '1951-02-12'),
 (100005, 'William', '1957-05-06'),
 (100006, 'Shelton', '1977-01-04'),
 (100007, 'Randolph', '1950-01-10'),
 (100008, 'Sawyer', '1998-06-04'),
 (100009, 'Shepard', '1963-04-06')]

In [8]:
import pandas as pd
import psycopg2
import sqlalchemy
import matplotlib as plt
%matplotlib inline

In [12]:
from sqlalchemy import create_engine
# EDB username, password, and database name
ADDRESS = 'localhost' 
PORT = '5444'
USERNAME = 'enterprisedb' 
PASSWORD = '123qwe123' 
DBNAME = 'stocks'
# connection string
edb_str = ('postgresql://{username}:{password}@{ipaddress}:{port}/{dbname}'
          .format(username=USERNAME,
           password=PASSWORD,
           ipaddress=ADDRESS,
           port=PORT,
           dbname=DBNAME))
# Create the connection
cnx = create_engine(edb_str)

In [104]:
sql = \
'''
select customerid, lastname, birthdate from customer fetch first 10 rows only
'''
df = pd.read_sql_query(sql, cnx) 
df.head(10)

   customerid  lastname   birthdate
0      100000     Brock  1960-10-13
1      100001  Chandler  1971-02-12
2      100002   Merrill  1988-08-02
3      100003     Wells  1959-03-11
4      100004   Lambert  1951-02-12
5      100005   William  1957-05-06
6      100006   Shelton  1977-01-04
7      100007  Randolph  1950-01-10
8      100008    Sawyer  1998-06-04
9      100009   Shepard  1963-04-06

In [88]:
%%sql
SELECT * FROM STOCK_SYMBOLS
FETCH FIRST 10 ROWS ONLY;

 * postgresql://enterprisedb:***@localhost:5444/stocks
10 rows affected.

[('AAPL', 'Apple Inc.'),
 ('AXP', 'American Express Company'),
 ('BA', 'The Boeing Company'),
 ('CAT', 'Caterpillar Inc.'),
 ('AAPL', 'Apple Inc.'),
 ('AXP', 'American Express Company'),
 ('BA', 'The Boeing Company'),
 ('CAT', 'Caterpillar Inc.'),
 ('AAPL', 'Apple Inc.'),
 ('AXP', 'American Express Company')]

In [130]:
%%sql
SELECT tx_date, custid, price*quantity::money as value FROM STOCK_TRANSACTIONS 
    WHERE SYMBOL = 'AXP'
    AND TX_DATE::date >= '2018-12-01'
    AND TX_DATE::date <= '2018-12-07' 
    ORDER BY value DESC
FETCH FIRST 10 ROWS ONLY;

 * postgresql://enterprisedb:***@localhost:5444/stocks
10 rows affected.

[('2018-12-03', 101935, '$5,607.50'),
 ('2018-12-04', 109956, '$5,591.50'),
 ('2018-12-03', 105940, '$5,543.86'),
 ('2018-12-04', 100922, '$5,484.57'),
 ('2018-12-07', 102071, '$5,430.50'),
 ('2018-12-04', 107504, '$5,336.64'),
 ('2018-12-03', 101514, '$5,327.92'),
 ('2018-12-03', 104054, '$5,308.18'),
 ('2018-12-06', 109361, '$5,273.87'),
 ('2018-12-03', 101310, '$5,169.48')]

In [110]:
sql = \
'''
SELECT SYMBOL, EXTRACT(DOW FROM TX_DATE::date) AS DAYOWEEK, VOLUME/1000000 AS VOLUME
  FROM STOCK_HISTORY
  WHERE SYMBOL IN ('INTC' ,'MSFT' ,'AAPL' ) AND EXTRACT(WEEK FROM TX_DATE::date) =  45;
'''
df = pd.read_sql_query(sql, cnx) 
df.head(10)

  symbol  dayoweek   volume
0   AAPL       1.0  66.1637
1   AAPL       2.0  31.8829
2   AAPL       3.0  33.4244
3   AAPL       4.0  25.3626
4   AAPL       5.0  34.3658
5   INTC       1.0  23.7512
6   INTC       2.0  23.8396
7   INTC       3.0  29.9132
8   INTC       4.0  26.5817
9   INTC       5.0  21.7614

#### Bought/Sold Amounts of Top 10 stocks

In [34]:
sql = \
'''
WITH BOUGHT(
    SYMBOL,
    AMOUNT
  ) AS
  (
SELECT SYMBOL, SUM(QUANTITY)
  FROM STOCK_TRANSACTIONS
  WHERE QUANTITY > 0
  GROUP BY SYMBOL
  ), SOLD(
    SYMBOL,
    AMOUNT
  ) AS
  (
  SELECT SYMBOL, -SUM(QUANTITY)
  FROM STOCK_TRANSACTIONS
  WHERE QUANTITY < 0
  GROUP BY SYMBOL
  )
  SELECT B.SYMBOL, B.AMOUNT AS BOUGHT, S.AMOUNT AS SOLD
  FROM BOUGHT B, SOLD S
  WHERE B.SYMBOL = S.SYMBOL
  ORDER BY B.AMOUNT DESC;
'''
df = pd.read_sql_query(sql, cnx) 
df.head(10)

  symbol  bought    sold
0     KO  694562  409390
1   CSCO  692836  408547
2    PFE  683095  393959
3   INTC  639324  368778
4     VZ  592401  340565
5    WBA  524353  308526
6   DWDP  524208  304799
7     PG  523641  302488
8    NKE  520128  296844
9    MRK  516955  297495

#### Top Stocks Bought and Sold

In [133]:
sql = \
'''
WITH WEEK45(
    SYMBOL,
    PURCHASES
  ) AS (
  SELECT SYMBOL, SUM(VOLUME * CLOSE)::money
  FROM STOCK_HISTORY
  WHERE EXTRACT(WEEK FROM TX_DATE::date) =  45 AND SYMBOL <> 'DJIA'
  GROUP BY SYMBOL
), ALL45(TOTAL) AS (
  SELECT SUM(PURCHASES) * .03
  FROM WEEK45
)
  SELECT SYMBOL, PURCHASES
  FROM WEEK45, ALL45
  WHERE PURCHASES > TOTAL
  ORDER BY PURCHASES DESC;
'''
df = pd.read_sql_query(sql, cnx) 
df.head(10)

  symbol           purchases
0   AAPL  $39,166,795,196.00
1   MSFT  $16,243,568,966.00
2      V   $6,573,738,587.00
3    JPM   $6,192,625,572.00
4   INTC   $6,072,315,705.00
5    IBM   $5,968,157,436.00
6    DIS   $5,744,221,436.00
7    XOM   $5,685,491,754.00
8    PFE   $5,511,855,399.00
9     BA   $5,192,502,109.00

#### Top Customers in OHIO in the highest trading day

In [141]:
%%sql
WITH MAX_VOLUME(AMOUNT) AS (
  SELECT MAX(VOLUME) FROM STOCK_HISTORY
    WHERE SYMBOL = 'DJIA'
),
HIGHDATE(TX_DATE) AS (
  SELECT TX_DATE FROM STOCK_HISTORY, MAX_VOLUME M
    WHERE SYMBOL = 'DJIA' AND VOLUME = M.AMOUNT
),
CUSTOMERS_IN_OHIO(CUSTID) AS (
  SELECT C.CUSTOMERID FROM CUSTOMER C 
    WHERE C.STATE = 'OH'
),
TOTAL_BUY(CUSTID,TOTAL) AS (
  SELECT C.CUSTID, SUM(SH.QUANTITY * SH.PRICE) 
    FROM CUSTOMERS_IN_OHIO C, STOCK_TRANSACTIONS SH, HIGHDATE HD
  WHERE SH.CUSTID = C.CUSTID AND
        SH.TX_DATE = HD.TX_DATE AND 
        QUANTITY > 0 
  GROUP BY C.CUSTID
)
  SELECT LASTNAME, CUSTOMERID, T.TOTAL::money
    FROM CUSTOMER C, TOTAL_BUY T
    WHERE C.CUSTOMERID = T.CUSTID
    ORDER BY TOTAL DESC
    FETCH FIRST 10 ROWS ONLY;

 * postgresql://enterprisedb:***@localhost:5444/stocks
10 rows affected.

[('Noble', 108285, '$12,242.05'),
 ('Wynn', 107122, '$8,548.02'),
 ('Cherry', 104672, '$6,763.50'),
 ('Kirk', 101577, '$5,358.66'),
 ('Hurley', 104165, '$5,121.76'),
 ('Tyler', 100416, '$4,876.95'),
 ('Lara', 108809, '$4,759.64'),
 ('Chang', 107287, '$4,502.40'),
 ('Mendez', 104247, '$4,236.46'),
 ('Ball', 107573, '$4,235.86')]

#### Top Trading Day

In [142]:
%%sql
WITH MAX_VOLUME(AMOUNT) AS (
  SELECT MAX(VOLUME) FROM STOCK_HISTORY
    WHERE SYMBOL = 'DJIA'
)
  SELECT TX_DATE FROM STOCK_HISTORY, MAX_VOLUME M
    WHERE SYMBOL = 'DJIA' AND VOLUME = M.AMOUNT
FETCH FIRST 10 ROWS ONLY;

 * postgresql://enterprisedb:***@localhost:5444/stocks
1 rows affected.

[('2018-02-06',)]

#### Top Ten transactions

In [100]:
%%sql
SELECT TX_DATE, LASTNAME, T.CUSTID, SYMBOL, CAST(PRICE*QUANTITY AS MONEY) TRADE_VOLUME 
    FROM STOCK_TRANSACTIONS T, CUSTOMER C
        WHERE C.CUSTOMERID = T.CUSTID 
        ORDER BY TRADE_VOLUME DESC
            fetch first 10 rows only;

 * postgresql://enterprisedb:***@localhost:5444/stocks
10 rows affected.

[('2018-10-05', 'Bass', 109361, 'BA', '$7,829.60'),
 ('2018-10-04', 'Morse', 102002, 'BA', '$7,766.40'),
 ('2018-02-05', 'Talley', 104803, 'CAT', '$7,758.50'),
 ('2018-10-04', 'Michael', 106008, 'BA', '$7,752.20'),
 ('2018-02-06', 'Glover', 101489, 'IBM', '$7,747.00'),
 ('2018-02-06', 'Knight', 102489, 'IBM', '$7,743.00'),
 ('2018-10-02', 'Anderson', 100139, 'BA', '$7,739.00'),
 ('2018-02-06', 'Pugh', 109411, 'CAT', '$7,722.00'),
 ('2018-12-10', 'Lindsey', 103297, 'JPM', '$7,698.75'),
 ('2018-10-05', 'House', 106752, 'BA', '$7,698.20')]

In [143]:
stock = 'AAPL'

In [167]:
sql = \
"""
SELECT tx_date, close FROM STOCK_HISTORY 
    WHERE SYMBOL = 'AXP'
    AND TX_DATE::date >= '2018-12-01'
    AND TX_DATE::date <= '2018-12-31' 
    ORDER BY tx_date;
"""
df = pd.read_sql_query(sql, cnx) 
df.head(10)

      tx_date   close
0  2018-12-03  112.36
1  2018-12-04  107.64
2  2018-12-06  108.25
3  2018-12-07  106.68
4  2018-12-10  105.79
5  2018-12-11  105.40
6  2018-12-12  107.48
7  2018-12-13  106.70
8  2018-12-14  105.70

In [170]:
sqlin = \
"""
SELECT tx_date, close FROM STOCK_HISTORY 
    WHERE SYMBOL = 'AXP'
    AND TX_DATE::date >= '2018-12-01'
    AND TX_DATE::date <= '2018-12-31' 
    ORDER BY tx_date;
"""
df = pd.read_sql_query(sql, cnx) 
df.head(10)


txdate= df['tx_date']
close = df['close']

plt.xlabel("Day", fontsize=12);
plt.ylabel("Close", fontsize=12);
plt.plot(txdate, close, 'r');
plt.show();

AttributeError: module 'matplotlib' has no attribute 'xlabel'